// / 1)რა განსხვავებაა let, const შორის?
// // 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
// // 3)რა განსხვავებაა == და === ოპერატორებს შორის?
// // 4)რა ტიპის არის null
// // 5)რა განსხვავებაა funtion და = () => {} შორის
// // 6)რას ნიშნავს callback function?
// // 7)რა განსხვავებაა map, filter და reduce-ს შორის?
// // 8)რა არის Promise?
// // 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
// // 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
// // 11)რა განსხვავებაა class-სა და object-ს შორის?
// // 12)რას აკეთებს constructor class-ში?
// //13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
// //14) რა არის ქოლსტეკი
// //15) რა არის ივენთ ლუპი


// 1) let-ზე შესაძლებელია მნიშვნელობის შეცვლა, ხოლო const-ზე არა
// 2) პრიმიტიული - მონაცემთა მარტივი ტიპები მაგ:str, num, null და ა.შ. არაპრიმიტიული - ობიექტები მაგ: obj, arr, symbol
// 3) ორი ტოლობის დროს კონვერტირდება, ბოლო სამი ტოლობა ამოწმებს როგორც ტიპს ასევე მნიშვნელობას
// 4) null არის ცარიელი მნიშვნელობა
// 5) - 
// 6) ფუნქცია, რომელიც გადაეცემა აგრგუმენტად სხვა ფუნქციას და რაღაც მომენტის შემდეგ სრულდება
// 7) map - მასივის თითოეულ ელემენტს გარდაქმნის და ახალ მასივში აბრუნებს, filter - ტოვებს იმ ელემენტებს, რომლებიც აკმაყოფილებს პირობას
// reduce - მთელ მასივს აჯამებს ერთ საბოლოო მნიშვნელობამდე
// 8) promise - ობიექტია, რომეელიც წარმოადგენს ასინქრონულ ოპერაციას
// 9)promise.all - ამ შემთხვევაში უნდა იყოს ყველა ან დარესორვებული ან დარეჯექტებული.
// promise.any - ამ შემთხვევაში პირველივე წარმატებულს აბრუნებს
// promise.race - რომელიც პირველი შესრულდება (მოასწრებს) იმას გამოტანს
// 10) პრომისის გამარტივებული ვერსიაა, სადაც შესაძლებელი ხდება, რომ კოდი წაკითხვადი იყოს
// 11) class - არის შაბლონი ობიექტის შესასრულებლად, ცოლო obj - არის კონკრეტული ეგზემპლარი, რომელიც კლასის საფუძველზეა შექმნილი
// 12) მეთოდი, რომელიც იძახებს ავტომატურად ობიექტის ინიციალიზაციას
// 13) -
// 14) - 
// 15) მექანიზმი, რომელიც მართავს კოდის შესრულებას და ასინქრულ ოპერაციებს